# Megapascals Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Megapascals Property
UnitTypeId Class See Also
---
Megapascals.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Megapascals { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Megapascals As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Megapascals {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace